CSI API ETABS v1

# cDetailingGetDetailingAvailable Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    bool GetDetailingAvailable()

    Function GetDetailingAvailable As Boolean

    Dim instance As cDetailing
    Dim returnValue As Boolean

    returnValue = instance.GetDetailingAvailable()

    bool GetDetailingAvailable()

    abstract GetDetailingAvailable : unit -> bool

#### Return Value

Type: Boolean

See Also

#### Reference

cDetailing Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com